Tekla Open API Reference for Tekla Structures 2025
OBB.SetAxis Method (Vector, Vector, Vector)
 Sets the Axis to the OBB.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAxis(
	Vector axis0,
	Vector axis1,
	Vector axis2
)
Public Sub SetAxis (
	axis0 As Vector,
	axis1 As Vector,
	axis2 As Vector
)
Parameters
axis0
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to one axis of the OBB.
axis1
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to the second axis of the OBB.
axis2
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to the third axis of the OBB.
Exceptions
Exception | Condition
ArgumentException | Thrown when setting the axis fails.
See Also
Reference
OBB Class
SetAxis Overload
Tekla.Structures.Geometry3d Namespace